----------------------------------------------------------------------------------------------
[연습문제 3-4]
사번, 성, 부서코드, 업무코드, 입사일자, 매니저코드, 매니저존재여부(NVL, NVL2 각각 사용) 조회
매니저존재여부는 각 사원에 대해 

NVL은 
    관리자가 있으면 manager_id와 관리자가 없으면 '0'으로 표시,
    관리자가 있으면 manager_id와 관리자가 없으면 '없음'으로 표시,
NVL2는
사원의 관리자(매니저)가 있으면 '있음' 으로 --manager_id, 'O','Manager'   
       관리자(매니저)가 없으면 '없음' 으로 --'없음',     'X','No Manager' 등으로 조회되게 한다.
       
DESC employees;  manager_id ☜ number(6,0)      

1. NVL
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
사번 성     부서코드 업무코드  입사일  MANAGER_ID manager_id/0(NVL)  manager_id/없음(NVL)     있음/없음(NVL)  O/X(NVL) Manager/No Manager
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
100  King         90 AD_PRES   03/06/17     (null)                0  없음                     없음            X         No Manager
101  Kochhar      90 AD_VP     05/09/21        100              100  100                      있음            O         Manager   
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      
2. NVL2
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
사번 성     부서코드 업무코드  입사일  MANAGER_ID manager_id/0(NVL2) manager_id/없음(NVL2)    있음/없음(NVL2) O/X(NVL2) Manager/No Manager
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
100  King         90 AD_PRES   03/06/17     (null)                0  없음                     없음            X         No Manager
101  Kochhar      90 AD_VP     05/09/21        100              100  100                      있음            O         Manager   
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------

1. NVL
사번 성      부서코드 업무코드  입사일자 manager_id manager_id/0(NVL)  manager_id/없음(NVL)  있음/없음(NVL)   O/X(NVL)   Manager/No Manager(NVL)
1. NVL
SELECT  employee_id "사번", last_name "성", department_id "부서코드", job_id "업무코드", hire_date "입사일자", manager_id "manager_id",
        NVL(manager_id,0) "manager_id/0(NVL)",
        NVL(TO_CHAR(manager_id),'없음') "manager_id/없음(NVL)"
--        manager_id, "있음/없음(NVL)",   --☜ NVL 함수로 해결 불가, NVL2 함수 해결
--         "O/X(NVL)",                    --☜ NVL 함수로 해결 불가, NVL2 함수 해결
--         "Manager/No Manager(NVL)"      --☜ NVL 함수로 해결 불가, NVL2 함수 해결

FROM employees;

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------

2. NVL2
사번 성      부서코드 업무코드  입사일자 manager_id 없으면0(NVL2) 없으면없음(NVL2) 매니저있음없음(NVL2) manager_id 없음(NVL2) 있으면O없으면X(NVL2) Manager No Manager(NVL2)

SELECT  employee_id "사번", last_name "성", department_id "부서코드", job_id "업무코드", hire_date "입사일자", manager_id "manager_id",
        NVL2(manager_id, manager_id, 0) "manager_id/0(NVL)",
        NVL2(manager_id, TO_CHAR(manager_id), '없음') "manager_id/없음(NVL)",
        NVL2(manager_id, '있음','없음') "있음/없음(NVL)",   
        NVL2(manager_id, 'O','X') "O/X(NVL)",                    
        NVL2(manager_id, 'Manager', 'No Manager')  "Manager/No Manager(NVL)"      
FROM    employees;
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------



